app/controllers/line_items_controller.rb

  def index
    @line_items = LineItem.all
---
SELECT `line_items`.* FROM `line_items`

  def create
    #@line_item = LineItem.new(line_item_params)
    @cart = current_cart
    product = Product.find(params[:product_id])
    # line_items = @cart.line_items
    # @line_item = line_items.build(:product => product)
    # @line_item = @cart.line_items.build
    # @line_item.product = product
    @line_item = @cart.line_items.build(:product_id => product.id)
    respond_to do |format|
      if @line_item.save
---
INSERT INTO `carts` (`created_at`, `updated_at`) VALUES ('2014-09-08 11:14:10', '2014-09-08 11:14:10')
INSERT INTO `line_items` (`cart_id`, `created_at`, `product_id`, `updated_at`) VALUES (3, '2014-09-08 11:15:20', 980190979, '2014-09-08 11:15:20')

  def destroy
    @line_item.destroy
---
DELETE FROM `line_items` WHERE `line_items`.`id` = 2

    def set_line_item
      @line_item = LineItem.find(params[:id])
---
SELECT  `line_items`.* FROM `line_items`  WHERE `line_items`.`id` = 2 LIMIT 1