app/controllers/products_controller.rb

INSERT INTO `products` (`created_at`, `description`, `image_url`, `price`, `title`, `updated_at`) VALUES ('2014-09-06 02:42:27', '2', '3', 4.0, '1', '2014-09-06 02:42:27')
---
  def create
    #@product = Product.new(product_params)
    breakpoint
    @product = Product.new
    title = params[:product][:title]
    description = params[:product][:description]
    image = params[:product][:image_url]
    img_data = ""
    name = ""
    if image.present?
        img_data = image.read
        name = image.original_filename
        time = Time.now.strftime("%Y%m%d%H%M%S")
        new_name_begin = time
        new_name_end = File.extname(name)
        new_name = new_name_begin+new_name_end
        @product.image_url = new_name
        File.open("#{Rails.root}/app/assets/images/"+new_name, "wb") { |file|
        file.write(img_data)
     }
    end
    price = params[:product][:price]
    #content_size = image.size
    @product.title = title
    @product.description = description
    @product.price = price
    respond_to do |format|
      if @product.save

UPDATE `products` SET `description` = '7888844', `image_url` = '20140906232211.jpg', `price` = 55.0, `title` = '788844', `updated_at` = '2014-09-06 23:22:11' WHERE `products`.`id` = 980190979
---
  def update
   product = Hash.new
   price = params[:product][:price]
   title = params[:product][:title]
   description = params[:product][:description]
   image = params[:product][:image_url]
   img_data = ""
   if image.present?
      image = params[:product][:image_url]
      img_data = image.read
      name = image.original_filename
      time = Time.now.strftime("%Y%m%d%H%M%S")
      new_name_begin = time
      new_name_end = File.extname(name)
      new_name = new_name_begin+new_name_end
      product[:image_url] = new_name
      File.open("#{Rails.root}/app/assets/images/"+new_name, "wb") { |file|
      file.write(img_data)
     }
   end
   product[:title] = title
   product[:description] = description
   product[:price] = price

   puts "===========================: "+product.to_s
    respond_to do |format|
      if @product.update(product)